TEXTS = {
    "start": """Привет, {name}! ✨  
Добро пожаловать в бота. Создатель - @ryzz3.  
Наша задача это рааааазными схемами.. ладно, шучу :>
Выбери нужный раздел в меню ниже и начинай! 🚀""",

    "language_prompt": "🌍 Выберите язык:",

    "language_changed": {
        "ru": "✅ Язык изменён на русский. Возвращаю вас в главное меню.",
        "en": "✅ Language switched to English. Returning to the main menu."
    },

    "main_info": """📌 Важно к прочтению:  
🔹 [Основная инструкция](https://telegra.ph/Polnaya-osnovnaya-instrukciya-dlya-workrog-01-29)  
🔹 [Как правильно писать отзывы](https://telegra.ph/Podrobnaya-instrukciya-po-napisaniyu-otzyvov-Kasaemo-vseh-ploshchadok-workrog-01-29)""",

    "rules": "📜 [Правила работы](https://telegra.ph/Polnaya-osnovnaya-instrukciya-dlya-workrog-01-29)",

    "price_list": """💰 Актуальный прайс:  
📍 Гугл Карты — *60₽*  
📍 Яндекс Карты — *150₽*  
📍 Авито — *250₽*""",

    "projects": "🛠 В разработке. Скоро добавим! 😉",

    "other": "📢 [Отзывы обо мне](https://t.me/workrog/25)",

    "tasks_prompt": "📌 Выберите задание из списка:",

    "yandex_tasks": """📍 *Актуальные задания на Яндекс Картах:*  
- Барон Дверона Екатеринбург — `просп. Космонавтов, 54`  
- Барон Дверона Екатеринбург — `ул. Щорса, 128`  
- Альфа, наркологическая клиника — `Ростов-на-Дону`  
- Леген-Авто — `Орджоникидзе`""",

    "google_tasks": """📍 *Актуальные задания на Гугл Картах:*  
(Пока пусто, но скоро появятся!)""",

    "avito_task": "🛒 Для выполнения задания на Авито: [Перейти по ссылке](https://avito.ru)",

    "back_to_main": "🔙 Вы вернулись в главное меню.",

    "quote": "💡 *Мотивация дня:* {quote}"
}
